TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
/**
  ******************************************************************************
  * @file    STM32_BMPX.c
  * @brief   Implementation du driver STM32 HAL pour capteurs BMP085/BMP180/BMP280
  * @author  STM32_LIB_STYLE_GUIDE
  * @version 0.9.0
  * @date    2026-02-11
  * @copyright Libre sous licence MIT.
  ******************************************************************************
  */

#include "STM32_BMPX.h"
#include <math.h>       ///< powf() pour calcul altitude

/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/


/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Private functions ---------------------------------------------------------*/
/* Exported functions --------------------------------------------------------*/

#ifdef BMPX_DEBUG_ENABLE
const char* BMP_StatusToString(BMP_Status status)
{
    switch (status) {
        case BMP_OK:                  return "BMP_OK";
        case BMP_ERR_I2C:             return "BMP_ERR_I2C";
        case BMP_ERR_CHIP_ID:         return "BMP_ERR_CHIP_ID";
        case BMP_ERR_CAL_READ:        return "BMP_ERR_CAL_READ";
        case BMP_ERR_NULL_PTR:        return "BMP_ERR_NULL_PTR";
        case BMP_ERR_INVALID_PARAM:   return "BMP_ERR_INVALID_PARAM";
        case BMP_ERR_BUSY:            return "BMP_ERR_BUSY";
        case BMP_ERR_TIMEOUT:         return "BMP_ERR_TIMEOUT";
        case BMP_ERR_MATH:            return "BMP_ERR_MATH";
        case BMP_ERR_NOT_INITIALIZED: return "BMP_ERR_NOT_INITIALIZED";
        case BMP_ERR_NOT_CONFIGURED:  return "BMP_ERR_NOT_CONFIGURED";
        default:                      return "BMP_ERR_UNKNOWN";
    }
}

const char* BMP_SensorTypeToString(BMP_SensorType sensor_type)
{
    switch (sensor_type) {
        case BMP_SENSOR_BMP280:     return "BMP280";
        case BMP_SENSOR_BMP085_180: return "BMP085/BMP180";
        default:                    return "UNKNOWN";
    }
}
#else /* BMPX_DEBUG_ENABLE not defined — stubs retournant "" (évite linker error) */
const char* BMP_StatusToString(BMP_Status status)     { (void)status;      return ""; }
const char* BMP_SensorTypeToString(BMP_SensorType st) { (void)st;          return ""; }
#endif /* BMPX_DEBUG_ENABLE */

BMP_Status BMP_DetectAddress7b(I2C_HandleTypeDef *i2cdev, uint8_t *addr7b_out)
{
    if (i2cdev == NULL || addr7b_out == NULL) {
        return BMP_ERR_NULL_PTR;
    }

    const uint8_t addr_candidates_7b[] = { BMP_I2C_ADDR_SECONDARY_7B, BMP_I2C_ADDR_PRIMARY_7B };
    for (uint32_t i = 0; i < (sizeof(addr_candidates_7b) / sizeof(addr_candidates_7b[0])); ++i) {
        const uint16_t addr_8b = (uint16_t)(addr_candidates_7b[i] << 1);
        uint8_t reg = 0xD0u;
        uint8_t chip_id = 0u;

        if (HAL_I2C_Master_Transmit(i2cdev, addr_8b, &reg, 1u, 50u) != HAL_OK) {
            continue;
        }
        if (HAL_I2C_Master_Receive(i2cdev, addr_8b, &chip_id, 1u, 50u) != HAL_OK) {
            continue;
        }

        if (chip_id == 0x55u || chip_id == 0x58u) {
            *addr7b_out = addr_candidates_7b[i];
            return BMP_OK;
        }
    }

    return BMP_ERR_CHIP_ID;
}

// Registres de données de calibration
#define BMP_CAL_AC1 0xAA //!< R   Données de calibration (16 bits)
#define BMP_CAL_AC2 0xAC //!< R   Données de calibration (16 bits)
#define BMP_CAL_AC3 0xAE //!< R   Données de calibration (16 bits)
#define BMP_CAL_AC4 0xB0 //!< R   Données de calibration (16 bits)
#define BMP_CAL_AC5 0xB2 //!< R   Données de calibration (16 bits)
#define BMP_CAL_AC6 0xB4 //!< R   Données de calibration (16 bits)
#define BMP_CAL_B1 0xB6  //!< R   Données de calibration (16 bits)
#define BMP_CAL_B2 0xB8  //!< R   Données de calibration (16 bits)
#define BMP_CAL_MB 0xBA  //!< R   Données de calibration (16 bits)
#define BMP_CAL_MC 0xBC  //!< R   Données de calibration (16 bits)
#define BMP_CAL_MD 0xBE  //!< R   Données de calibration (16 bits)

// Commandes
#define BMP_CHIP_ID_REG 0xD0     //!< Registre contenant l'ID de la puce (devrait être 0x55)
#define BMP_CONTROL 0xF4         //!< Registre de contrôle
#define BMP_TEMPDATA 0xF6        //!< Registre des données de température
#define BMP_PRESSUREDATA 0xF6    //!< Registre des données de pression
#define BMP_READTEMPCMD 0x2E     //!< Commande pour lire la température
#define BMP_READPRESSURECMD 0x34 //!< Commande pour lire la pression

// Délais de conversion en ms selon le mode
#define BMP_TEMP_CONVERSION_DELAY 5
#define BMP_PRES_CONVERSION_DELAY_ULP 5
#define BMP_PRES_CONVERSION_DELAY_STD 8
#define BMP_PRES_CONVERSION_DELAY_HR 14
#define BMP_PRES_CONVERSION_DELAY_UHR 26
#define BMP_I2C_TIMEOUT BMPX_DEFAULT_TIMEOUT_MS ///< Timeout I2C (ms) — configurable dans STM32_BMPX_conf.h

// --- BMP280 (datasheet BST-BMP280-DS001) ---
#define BMP280_CHIP_ID 0x58
#define BMP280_REG_RESET 0xE0
#define BMP280_REG_STATUS 0xF3
#define BMP280_REG_CTRL_MEAS 0xF4
#define BMP280_REG_CONFIG 0xF5
#define BMP280_REG_PRESS_MSB 0xF7
#define BMP280_REG_CALIB00 0x88
#define BMP280_RESET_CMD 0xB6

// --- Fonctions statiques internes ---

// Fonctions de gestion I2C
// Retourne BMP_OK en cas de succès, ou un code d'erreur BMP_Status
static BMP_Status readBytes(BMP_Handle_t *bmp, uint8_t regAddr, uint8_t *buffer, uint8_t len)
{
    if (bmp == NULL || bmp->hi2c == NULL || buffer == NULL) {
        return BMP_ERR_NULL_PTR;
    }

    if (HAL_I2C_Master_Transmit(bmp->hi2c, (uint16_t)(bmp->i2cAddr7bit << 1), &regAddr, 1, BMP_I2C_TIMEOUT) != HAL_OK) {
        bmp->last_error = BMP_ERR_I2C;
        return BMP_ERR_I2C;
    }
    if (HAL_I2C_Master_Receive(bmp->hi2c, (uint16_t)(bmp->i2cAddr7bit << 1), buffer, len, BMP_I2C_TIMEOUT) != HAL_OK) {
        bmp->last_error = BMP_ERR_I2C;
        return BMP_ERR_I2C;
    }
    return BMP_OK;
}

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *value
static BMP_Status read8(BMP_Handle_t *bmp, uint8_t regAddr, uint8_t *value) // Lit un octet depuis un registre
{
    // Passe maintenant le handle bmp à readBytes
    return readBytes(bmp, regAddr, value, 1);
}

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *value
static BMP_Status read16(BMP_Handle_t *bmp, uint8_t regAddr, uint16_t *value) // Lit deux octets depuis un registre
{
    if (bmp == NULL || value == NULL) return BMP_ERR_NULL_PTR;
    uint8_t retbuf[2]; // Tampon pour stocker les deux octets
    BMP_Status status = readBytes(bmp, regAddr, retbuf, 2);
    if (status != BMP_OK) {
        return status; // Erreur
    }
    *value = ((uint16_t)retbuf[0] << 8) | retbuf[1]; // Combine les octets en un entier 16 bits (MSB first)
    return BMP_OK; // Succès
}

// Retourne BMP_OK en cas de succès
static BMP_Status write8(BMP_Handle_t *bmp, uint8_t regAddr, uint8_t data) // Écrit un octet dans un registre
{
    uint8_t tBuf[2]; // Tampon pour l'adresse et la donnée
    if (bmp == NULL) return BMP_ERR_NULL_PTR;
    tBuf[0] = regAddr; // Adresse du registre
    tBuf[1] = data; // Donnée à écrire
    if (HAL_I2C_Master_Transmit(bmp->hi2c, (uint16_t)(bmp->i2cAddr7bit << 1), tBuf, 2, BMP_I2C_TIMEOUT) != HAL_OK) {
        bmp->last_error = BMP_ERR_I2C;
        return BMP_ERR_I2C; // Erreur
    }
    return BMP_OK; // Succès
}

static uint16_t le_u16(const uint8_t *p)
{
  return (uint16_t)p[0] | ((uint16_t)p[1] << 8);
}

static int16_t le_i16(const uint8_t *p)
{
  return (int16_t)le_u16(p);
}

static BMP_Status bmp280_wait_nvm(BMP_Handle_t *bmp, uint32_t timeout_ms)
{
  if (bmp == NULL) return BMP_ERR_NULL_PTR;
  uint32_t start = HAL_GetTick();
  while ((HAL_GetTick() - start) < timeout_ms) {
    uint8_t st = 0;
    BMP_Status s = read8(bmp, BMP280_REG_STATUS, &st);
    if (s != BMP_OK) return s;
    if ((st & 0x01u) == 0u) return BMP_OK; // im_update==0
    HAL_Delay(2); /* init: NVM copy wait */
  }
  bmp->last_error = BMP_ERR_TIMEOUT;
  return BMP_ERR_TIMEOUT;
}

