TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
static BMP_Status bmp280_wait_measuring(BMP_Handle_t *bmp, uint32_t timeout_ms)
{
  if (bmp == NULL) return BMP_ERR_NULL_PTR;
  uint32_t start = HAL_GetTick();
  while ((HAL_GetTick() - start) < timeout_ms) {
    uint8_t st = 0;
    BMP_Status s = read8(bmp, BMP280_REG_STATUS, &st);
    if (s != BMP_OK) return s;
    if ((st & 0x08u) == 0u) return BMP_OK; // measuring==0
    HAL_Delay(2); /* convert: polling status mesure */
  }
  bmp->last_error = BMP_ERR_TIMEOUT;
  return BMP_ERR_TIMEOUT;
}

static BMP_Status bmp280_read_calib(BMP_Handle_t *bmp)
{
  if (bmp == NULL) return BMP_ERR_NULL_PTR;
  uint8_t b[24];
  BMP_Status s = readBytes(bmp, BMP280_REG_CALIB00, b, sizeof(b));
  if (s != BMP_OK) return s;

  bmp->dig_T1 = le_u16(&b[0]);
  bmp->dig_T2 = le_i16(&b[2]);
  bmp->dig_T3 = le_i16(&b[4]);
  bmp->dig_P1 = le_u16(&b[6]);
  bmp->dig_P2 = le_i16(&b[8]);
  bmp->dig_P3 = le_i16(&b[10]);
  bmp->dig_P4 = le_i16(&b[12]);
  bmp->dig_P5 = le_i16(&b[14]);
  bmp->dig_P6 = le_i16(&b[16]);
  bmp->dig_P7 = le_i16(&b[18]);
  bmp->dig_P8 = le_i16(&b[20]);
  bmp->dig_P9 = le_i16(&b[22]);
  bmp->t_fine = 0;
  return BMP_OK;
}

static uint8_t bmp280_map_osrs_p(uint8_t mode085)
{
  // Mapping simple de l'API BMP085/180 vers oversampling pression BMP280
  // 0: x1, 1: x2, 2: x4, 3: x16
  switch (mode085) {
    case BMP_ULTRALOWPOWER: return 1;  // x1
    case BMP_STANDARD:      return 2;  // x2
    case BMP_HIGHRES:       return 3;  // x4
    case BMP_ULTRAHIGHRES:  return 5;  // x16
    default:                return 5;
  }
}

static BMP_Status bmp280_configure(BMP_Handle_t *bmp)
{
  if (bmp == NULL) return BMP_ERR_NULL_PTR;

  // Reset
  BMP_Status s = write8(bmp, BMP280_REG_RESET, BMP280_RESET_CMD);
  if (s != BMP_OK) return s;
  HAL_Delay(5); /* init: post-reset timing */
  s = bmp280_wait_nvm(bmp, 100);
  if (s != BMP_OK) return s;

  // Read calibration
  s = bmp280_read_calib(bmp);
  if (s != BMP_OK) {
    bmp->last_error = BMP_ERR_CAL_READ;
    return BMP_ERR_CAL_READ;
  }

  // Put to sleep before config
  BMP280_Config cfg;
  cfg.osrs_t = BMP280_OSRS_X1;
  cfg.osrs_p = bmp280_map_osrs_p(bmp->oversampling);
  cfg.filter = BMP280_FILTER_OFF;
  cfg.standby = BMP280_STANDBY_1000_MS;
  cfg.mode = BMP280_MODE_NORMAL;

  s = BMP280_SetConfig(bmp, &cfg);
  if (s != BMP_OK) return s;

  return BMP_OK;
}

BMP_Status BMP280_SetConfig(BMP_Handle_t *bmp, const BMP280_Config *cfg)
{
  if (bmp == NULL || cfg == NULL) return BMP_ERR_NULL_PTR;
  if (bmp->sensorType != BMP_SENSOR_BMP280) return BMP_ERR_INVALID_PARAM;

  if (cfg->osrs_t > BMP280_OSRS_X16) return BMP_ERR_INVALID_PARAM;
  if (cfg->osrs_p > BMP280_OSRS_X16) return BMP_ERR_INVALID_PARAM;
  if (cfg->filter > BMP280_FILTER_16) return BMP_ERR_INVALID_PARAM;
  if (cfg->standby > BMP280_STANDBY_4000_MS) return BMP_ERR_INVALID_PARAM;
  if (!((cfg->mode == BMP280_MODE_SLEEP) || (cfg->mode == BMP280_MODE_FORCED) || (cfg->mode == BMP280_MODE_NORMAL))) {
    return BMP_ERR_INVALID_PARAM;
  }

  // Datasheet recommande: passer en sleep avant de modifier config
  BMP_Status s = write8(bmp, BMP280_REG_CTRL_MEAS, (uint8_t)((cfg->osrs_t << 5) | (cfg->osrs_p << 2) | BMP280_MODE_SLEEP));
  if (s != BMP_OK) return s;

  // CONFIG : t_sb[7:5], filter[4:2]
  s = write8(bmp, BMP280_REG_CONFIG, (uint8_t)((cfg->standby << 5) | (cfg->filter << 2)));
  if (s != BMP_OK) return s;

  // CTRL_MEAS : osrs_t[7:5], osrs_p[4:2], mode[1:0]
  s = write8(bmp, BMP280_REG_CTRL_MEAS, (uint8_t)((cfg->osrs_t << 5) | (cfg->osrs_p << 2) | (cfg->mode & 0x03u)));
  if (s != BMP_OK) return s;

  return BMP_OK;
}

BMP_Status BMP280_ReadAll_OneShot(BMP_Handle_t *bmp, float *temp_degC, int32_t *pressure_Pa, uint32_t timeout_ms)
{
  if (bmp == NULL || temp_degC == NULL || pressure_Pa == NULL) return BMP_ERR_NULL_PTR;
  if (bmp->sensorType != BMP_SENSOR_BMP280) return BMP_ERR_INVALID_PARAM;
  if (timeout_ms == 0u) timeout_ms = 100u;

  // Lire ctrl_meas pour récupérer osrs_t/osrs_p en place
  uint8_t ctrl = 0;
  BMP_Status s = read8(bmp, BMP280_REG_CTRL_MEAS, &ctrl);
  if (s != BMP_OK) return s;

  uint8_t osrs_t = (ctrl >> 5) & 0x07u;
  uint8_t osrs_p = (ctrl >> 2) & 0x07u;

  // Déclenche une mesure forced (mode=01)
  s = write8(bmp, BMP280_REG_CTRL_MEAS, (uint8_t)((osrs_t << 5) | (osrs_p << 2) | BMP280_MODE_FORCED));
  if (s != BMP_OK) return s;

  // Attendre fin de conversion
  s = bmp280_wait_measuring(bmp, timeout_ms);
  if (s != BMP_OK) return s;

  // Lire et compenser
    return BMP_ReadAll(bmp, temp_degC, pressure_Pa);
}

static BMP_Status bmp280_read_raw(BMP_Handle_t *bmp, int32_t *adc_T, int32_t *adc_P)
{
  if (bmp == NULL || adc_T == NULL || adc_P == NULL) return BMP_ERR_NULL_PTR;
  uint8_t b[6];
  BMP_Status s = readBytes(bmp, BMP280_REG_PRESS_MSB, b, sizeof(b));
  if (s != BMP_OK) return s;
  *adc_P = ((int32_t)b[0] << 12) | ((int32_t)b[1] << 4) | ((int32_t)b[2] >> 4);
  *adc_T = ((int32_t)b[3] << 12) | ((int32_t)b[4] << 4) | ((int32_t)b[5] >> 4);
  return BMP_OK;
}

static int32_t bmp280_comp_temp_01C(BMP_Handle_t *bmp, int32_t adc_T)
{
  int32_t var1 = ((((adc_T >> 3) - ((int32_t)bmp->dig_T1 << 1))) * ((int32_t)bmp->dig_T2)) >> 11;
  int32_t var2 = (((((adc_T >> 4) - ((int32_t)bmp->dig_T1)) * ((adc_T >> 4) - ((int32_t)bmp->dig_T1))) >> 12) * ((int32_t)bmp->dig_T3)) >> 14;
  bmp->t_fine = var1 + var2;
  return (bmp->t_fine * 5 + 128) >> 8; // 0.01°C
}

static int32_t bmp280_comp_press_Pa(BMP_Handle_t *bmp, int32_t adc_P)
{
  int64_t var1 = (int64_t)bmp->t_fine - 128000;
  int64_t var2 = var1 * var1 * (int64_t)bmp->dig_P6;
  var2 = var2 + ((var1 * (int64_t)bmp->dig_P5) << 17);
  var2 = var2 + (((int64_t)bmp->dig_P4) << 35);
  var1 = ((var1 * var1 * (int64_t)bmp->dig_P3) >> 8) + ((var1 * (int64_t)bmp->dig_P2) << 12);
  var1 = (((((int64_t)1) << 47) + var1) * (int64_t)bmp->dig_P1) >> 33;
  if (var1 == 0) {
    bmp->last_error = BMP_ERR_MATH;
    return 0;
  }

  int64_t p = 1048576 - (int64_t)adc_P;
  p = (((p << 31) - var2) * 3125) / var1;
  var1 = ((int64_t)bmp->dig_P9 * (p >> 13) * (p >> 13)) >> 25;
  var2 = ((int64_t)bmp->dig_P8 * p) >> 19;
  p = ((p + var1 + var2) >> 8) + (((int64_t)bmp->dig_P7) << 4);
  return (int32_t)(p >> 8);
}

// --- Fonctions Publiques ---

BMP_Status BMP_InitWithAddress(BMP_Handle_t *bmp, I2C_HandleTypeDef *i2cdev, uint8_t i2c_address_7bit, uint8_t mode)
{
  if (bmp == NULL || i2cdev == NULL) {
    // Ne peut pas stocker l'erreur dans bmp->last_error car bmp peut être NULL
    return BMP_ERR_NULL_PTR;
  }

