TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
  bmp->hi2c = i2cdev; // Associe le périphérique I2C
  bmp->initialized       = false;
  bmp->consecutive_errors = 0U;
  bmp->last_hal_error    = 0U;
  bmp->last_error = BMP_OK; // Initialise le statut d'erreur
  bmp->sensorType = BMP_SENSOR_UNKNOWN;

    BMP_Status addr_status = BMP_SetAddress(bmp, i2c_address_7bit); // Valide et configure l'adresse I2C active
    if (addr_status != BMP_OK) {
        return addr_status;
    }

    if (mode > BMP_ULTRAHIGHRES) { // Vérifie si le mode est valide
        bmp->last_error = BMP_ERR_INVALID_PARAM;
        return BMP_ERR_INVALID_PARAM;
    }
  bmp->oversampling = mode; // Définit le niveau de suréchantillonnage

  uint8_t chipId = 0;
  BMP_Status status = read8(bmp, BMP_CHIP_ID_REG, &chipId);
  if (status != BMP_OK) {
    bmp->last_error = status;
    return status;
  }

  if (chipId == 0x55) {
    bmp->sensorType = BMP_SENSOR_BMP085_180;
  } else if (chipId == BMP280_CHIP_ID) {
    bmp->sensorType = BMP_SENSOR_BMP280;
    // Configuration BMP280 (reset + calib + ctrl/config)
    status = bmp280_configure(bmp);
    if (status != BMP_OK) {
      bmp->last_error = status;
      return status;
    }
    bmp->initialized = true;
    return BMP_OK;
  } else {
    bmp->last_error = BMP_ERR_CHIP_ID;
    return BMP_ERR_CHIP_ID;
  }

  /* Lit les données de calibration */
  // Vérifier chaque lecture de calibration pour les erreurs I2C
  // Correction: read16 prend bmp, regAddr, value*
  #define CHECK_CAL_READ(reg, var_ptr) if ((status = read16(bmp, reg, (uint16_t*)var_ptr)) != BMP_OK) { bmp->last_error = status; return status; }
  CHECK_CAL_READ(BMP_CAL_AC1, &bmp->ac1);
  CHECK_CAL_READ(BMP_CAL_AC2, &bmp->ac2);
  CHECK_CAL_READ(BMP_CAL_AC3, &bmp->ac3);
  CHECK_CAL_READ(BMP_CAL_AC4, &bmp->ac4);
  CHECK_CAL_READ(BMP_CAL_AC5, &bmp->ac5);
  CHECK_CAL_READ(BMP_CAL_AC6, &bmp->ac6);

  CHECK_CAL_READ(BMP_CAL_B1, &bmp->b1);
  // Suppression des anciennes lignes if (read16(...) != 0)
  CHECK_CAL_READ(BMP_CAL_B2, &bmp->b2);

  CHECK_CAL_READ(BMP_CAL_MB, &bmp->mb);
  CHECK_CAL_READ(BMP_CAL_MC, &bmp->mc);
  CHECK_CAL_READ(BMP_CAL_MD, &bmp->md);
  #undef CHECK_CAL_READ

  bmp->initialized = true;
  return BMP_OK; // Initialisation réussie
}

BMP_Status BMP_InitAuto(BMP_Handle_t *bmp, I2C_HandleTypeDef *i2cdev, uint8_t mode)
{
    uint8_t addr7b = 0u;
    BMP_Status detect_status = BMP_DetectAddress7b(i2cdev, &addr7b);
    if (detect_status != BMP_OK) {
        if (bmp != NULL) {
            bmp->last_error = detect_status;
        }
        return detect_status;
    }

    return BMP_InitWithAddress(bmp, i2cdev, addr7b, mode);
}

BMP_Status BMP_DeInit(BMP_Handle_t *bmp)
{
    if (bmp == NULL)
        return BMP_ERR_NULL_PTR;

    bmp->hi2c               = NULL;
    bmp->initialized        = false;
    bmp->consecutive_errors = 0U;
    bmp->last_hal_error     = 0U;
    bmp->last_error         = BMP_OK;
    bmp->sensorType         = BMP_SENSOR_UNKNOWN;
    bmp->i2cAddr7bit        = 0U;
    bmp->oversampling       = 0U;
    return BMP_OK;
}

BMP_Status BMP_SetAddress(BMP_Handle_t *bmp, uint8_t i2c_address_7bit)
{
    if (bmp == NULL) {
        return BMP_ERR_NULL_PTR;
    }

    if (i2c_address_7bit != BMP_I2C_ADDR_PRIMARY_7B &&
        i2c_address_7bit != BMP_I2C_ADDR_SECONDARY_7B) {
        bmp->last_error = BMP_ERR_INVALID_PARAM;
        return BMP_ERR_INVALID_PARAM;
    }

    bmp->i2cAddr7bit = i2c_address_7bit;
    bmp->last_error = BMP_OK;
    return BMP_OK;
}

BMP_Status BMP_UsePrimaryAddress(BMP_Handle_t *bmp)
{
    return BMP_SetAddress(bmp, BMP_I2C_ADDR_PRIMARY_7B);
}

BMP_Status BMP_UseSecondaryAddress(BMP_Handle_t *bmp)
{
    return BMP_SetAddress(bmp, BMP_I2C_ADDR_SECONDARY_7B);
}

uint8_t BMP_GetAddress(const BMP_Handle_t *bmp)
{
    if (bmp == NULL || bmp->hi2c == NULL) {
        return 0u;
    }

    return bmp->i2cAddr7bit;
}

// --- Fonctions de calcul internes (utilisent le handle) ---

// Calcule la valeur B5 pour la température. Retourne B5 ou 0 en cas d'erreur.
static int32_t computeB5(BMP_Handle_t *bmp, int32_t UT)
{
  if (bmp == NULL) {
      return 0; // Ne peut pas définir last_error (bmp NULL)
  }

  int32_t X1 = (UT - (int32_t)bmp->ac6) * ((int32_t)bmp->ac5) >> 15;
  int32_t denom = X1 + (int32_t)bmp->md;
  if (denom == 0) {
      bmp->last_error = BMP_ERR_MATH;
      return 0; // Erreur de division par zéro potentielle
  }
  int32_t X2 = ((int32_t)bmp->mc << 11) / denom;
  return X1 + X2; // Retourne la somme de X1 et X2
}

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *ut
static BMP_Status readRawTemperature(BMP_Handle_t *bmp, int32_t *ut) // Lit la température brute
{
  if (bmp == NULL || ut == NULL) {
      return BMP_ERR_NULL_PTR;
  }

  BMP_Status status = write8(bmp, BMP_CONTROL, BMP_READTEMPCMD);
  if (status != BMP_OK) return status; // Erreur I2C
  HAL_Delay(BMP_TEMP_CONVERSION_DELAY); // Attend la conversion
  uint16_t raw_temp;
  // Correction: Appel à read16 avec les bons arguments
  status = read16(bmp, BMP_TEMPDATA, &raw_temp);
  if (status != BMP_OK) return status; // Erreur I2C
  *ut = raw_temp;
  return BMP_OK; // Succès
}

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *up
static BMP_Status readRawPressure(BMP_Handle_t *bmp, int32_t *up) // Lit la pression brute
{
  uint16_t raw_pres_h;
  uint8_t  raw_pres_l;
  uint32_t delay_ms;
  // Suppression de l'ancien appel write8 incorrect

  if (bmp == NULL || up == NULL) {
      return BMP_ERR_NULL_PTR;
  }

  BMP_Status status = write8(bmp, BMP_CONTROL, BMP_READPRESSURECMD + (bmp->oversampling << 6));
  if (status != BMP_OK) return status;

  // Choix du délai en fonction du mode
  if (bmp->oversampling == BMP_ULTRALOWPOWER) // Vérifie le niveau de suréchantillonnage
    delay_ms = BMP_PRES_CONVERSION_DELAY_ULP;
  else if (bmp->oversampling == BMP_STANDARD)
    delay_ms = BMP_PRES_CONVERSION_DELAY_STD;
  // Correction: Utilisation de bmp->oversampling
  else if (bmp->oversampling == BMP_HIGHRES)
    delay_ms = BMP_PRES_CONVERSION_DELAY_HR;
  else
    delay_ms = BMP_PRES_CONVERSION_DELAY_UHR;

  HAL_Delay(delay_ms);

