TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
  status = read16(bmp, BMP_PRESSUREDATA, &raw_pres_h); // Lit les deux premiers octets de la pression
  // Correction: Appel à read16 avec les bons arguments (déjà correct ici)
  if (status != BMP_OK) return status;
  status = read8(bmp, BMP_PRESSUREDATA + 2, &raw_pres_l); // Lit le troisième octet
  // Correction: Appel à read8 avec les bons arguments (déjà correct ici)
  if (status != BMP_OK) return status;

  *up = ((uint32_t)raw_pres_h << 8) | raw_pres_l;
  *up >>= (8 - bmp->oversampling); // Ajuste selon le niveau de suréchantillonnage

  return BMP_OK; // Succès
}

// --- Fonctions de lecture publiques ---

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *temp_degC
BMP_Status BMP_ReadTemperature(BMP_Handle_t *bmp, float *temp_degC) // Calcule et retourne la température en °C
{
  if (bmp == NULL || temp_degC == NULL) {
      return BMP_ERR_NULL_PTR;
  }

  if (bmp->sensorType == BMP_SENSOR_BMP280) {
      int32_t adc_T = 0, adc_P = 0;
      BMP_Status s = bmp280_read_raw(bmp, &adc_T, &adc_P);
      if (s != BMP_OK) return s;
      int32_t t01 = bmp280_comp_temp_01C(bmp, adc_T);
      *temp_degC = (float)t01 / 100.0f;
      return BMP_OK;
  }

  int32_t UT = 0;
  int32_t B5;
  float temp; // Variable pour la température finale
  BMP_Status status;

  status = readRawTemperature(bmp, &UT); // Lit la température brute
  if (status != BMP_OK) {
      return status; // Erreur I2C ou autre
  }

  B5 = computeB5(bmp, UT); // Calcule B5
  if (bmp->last_error != BMP_OK) {
      return bmp->last_error; // Vérifie erreur dans computeB5
  }
  temp = (B5 + 8) >> 4; // Calcule la température en dixièmes de degré
  temp /= 10; // Convertit en degrés Celsius

    *temp_degC = temp;

  return BMP_OK; // Succès
}

// Calcule la pression finale à partir de la pression brute (UP) et de B5 (calculé à partir de la température brute)
// Retourne la pression en Pa.
// Note : Cette fonction NE lit PAS les valeurs brutes, elle fait juste le calcul.
// Suppression de la définition dupliquée
static int32_t calculatePressure(BMP_Handle_t *bmp, int32_t UP, int32_t B5) // Garde celle-ci
{
  if (bmp == NULL) {
      return 0; // Ne peut pas stocker l'erreur
  }

  int32_t B3, B6, X1, X2, X3, p; // Variables intermédiaires
  uint32_t B4, B7; // Variables intermédiaires non signées

  // Effectue les calculs de pression
  B6 = B5 - 4000;
  X1 = ((int32_t)bmp->b2 * ((B6 * B6) >> 12)) >> 11;
  X2 = ((int32_t)bmp->ac2 * B6) >> 11;
  X3 = X1 + X2;
  B3 = ((((int32_t)bmp->ac1 * 4 + X3) << bmp->oversampling) + 2) / 4;

  X1 = ((int32_t)bmp->ac3 * B6) >> 13;
  X2 = ((int32_t)bmp->b1 * ((B6 * B6) >> 12)) >> 16;
  X3 = ((X1 + X2) + 2) >> 2;
  B4 = ((uint32_t)bmp->ac4 * (uint32_t)(X3 + 32768)) >> 15;

  if (B4 == 0) { // Vérification division par zéro
      bmp->last_error = BMP_ERR_MATH;
      return 0;
  }

  B7 = ((uint32_t)UP - B3) * (uint32_t)(50000UL >> bmp->oversampling);

  if (B7 < 0x80000000) // Vérifie si B7 est inférieur à une limite
  {
    p = (B7 * 2) / B4; // Calcule la pression
  }
  else
  {
    p = (B7 / B4) * 2; // Calcule la pression
  }
  X1 = (p >> 8) * (p >> 8);
  X1 = (X1 * 3038) >> 16;
  X2 = (-7357 * p) >> 16;

  p = p + ((X1 + X2 + (int32_t)3791) >> 4); // Ajuste la pression finale

  return p;
}

// Retourne BMP_OK en cas de succès. Met la valeur lue dans *pressure_Pa
// Fonction conservée pour compatibilité ou usage simple, mais moins efficace que BMP_ReadAll.
BMP_Status BMP_ReadPressure(BMP_Handle_t *bmp, int32_t *pressure_Pa) // Calcule et retourne la pression en Pa
{
  if (bmp == NULL || pressure_Pa == NULL) {
      return BMP_ERR_NULL_PTR;
  }

  if (bmp->sensorType == BMP_SENSOR_BMP280) {
      int32_t adc_T = 0, adc_P = 0;
      BMP_Status s = bmp280_read_raw(bmp, &adc_T, &adc_P);
      if (s != BMP_OK) return s;
      (void)bmp280_comp_temp_01C(bmp, adc_T);
      int32_t pPa = bmp280_comp_press_Pa(bmp, adc_P);
      if (bmp->last_error != BMP_OK) return bmp->last_error;
      *pressure_Pa = pPa;
      return BMP_OK;
  }

  int32_t UT, UP, B5;
  BMP_Status status;

  // Lire la température brute (nécessaire pour le calcul de pression)
  status = readRawTemperature(bmp, &UT);
  if (status != BMP_OK) {
      return status;
  }
  // Lire la pression brute
  status = readRawPressure(bmp, &UP);
  if (status != BMP_OK) {
      return status;
  }

  B5 = computeB5(bmp, UT); // Calcule B5
  if (bmp->last_error != BMP_OK) {
      return bmp->last_error; // Vérifie erreur dans computeB5
  }

  *pressure_Pa = calculatePressure(bmp, UP, B5); // Calcule la pression finale
  if (bmp->last_error != BMP_OK) {
      return bmp->last_error; // Vérifie erreur dans calculatePressure
  }

  return BMP_OK; // Succès
}

// Lit la température et la pression de manière optimisée.
// Retourne BMP_OK en cas de succès.
BMP_Status BMP_ReadAll(BMP_Handle_t *bmp, float *temp_degC, int32_t *pressure_Pa)
{
    if (bmp == NULL || temp_degC == NULL || pressure_Pa == NULL) {
        return BMP_ERR_NULL_PTR;
    }

  if (bmp->sensorType == BMP_SENSOR_BMP280) {
    int32_t adc_T = 0, adc_P = 0;
    BMP_Status s = bmp280_read_raw(bmp, &adc_T, &adc_P);
    if (s != BMP_OK) return s;
    int32_t t01 = bmp280_comp_temp_01C(bmp, adc_T);
    int32_t pPa = bmp280_comp_press_Pa(bmp, adc_P);
    if (bmp->last_error != BMP_OK) return bmp->last_error;
    *temp_degC = (float)t01 / 100.0f;
    *pressure_Pa = pPa;
    return BMP_OK;
  }

    int32_t UT, UP, B5;
    float temp;
    BMP_Status status;

    // 1. Lire la température brute
    status = readRawTemperature(bmp, &UT);
    if (status != BMP_OK) {
        return status;
    }

    // 2. Lire la pression brute
    status = readRawPressure(bmp, &UP);
    if (status != BMP_OK) {
        return status;
    }

    // 3. Calculer B5 (nécessaire pour les deux)
    // Correction: Appel à computeB5 avec le handle
    B5 = computeB5(bmp, UT);
    if (bmp->last_error != BMP_OK) {
        return bmp->last_error; // Vérifie erreur dans computeB5
    }

    // 4. Calculer la température finale
    temp = (B5 + 8) >> 4;
    temp /= 10;
    *temp_degC = temp;

    // 5. Calculer la pression finale
    *pressure_Pa = calculatePressure(bmp, UP, B5);
    if (bmp->last_error != BMP_OK) {
        return bmp->last_error; // Vérifie erreur dans calculatePressure
    }
    return BMP_OK; // Succès
}

// --- Fonctions de calcul publiques (ne dépendent pas directement du handle) ---

// Calcule l'altitude en mètres. Retourne BMP_OK ou BMP_ERR_INVALID_PARAM.
BMP_Status BMP_CalculateAltitude(int32_t pressure_Pa, float sealevelPressure_Pa, float *altitude_m)
{
  if (altitude_m == NULL) {
      return BMP_ERR_NULL_PTR;
  }

  if (pressure_Pa <= 0 || sealevelPressure_Pa <= 0) { // Vérifie les pressions valides
      *altitude_m = NAN; // Ou une autre valeur d'erreur comme -9999.0f
      return BMP_ERR_INVALID_PARAM;
  }
  // Utilise powf pour les opérations en virgule flottante
  *altitude_m = 44330.0f * (1.0f - powf((float)pressure_Pa / sealevelPressure_Pa, 0.1903f)); // Calcule l'altitude
  return BMP_OK;
}

// Calcule la pression au niveau de la mer (Pa) à partir de la pression mesurée (Pa) et de l'altitude (m)
int32_t BMP_CalculateSeaLevelPressure(int32_t pressure_Pa, float altitude_m) // Cette fonction n'est pas utilisée dans main.c pour l'instant
{
  // Utilise powf pour les opérations en virgule flottante
  // Attention : vérifier que le dénominateur ne devient pas nul ou négatif si altitude_m est très grand
  float factor = powf(1.0f - altitude_m / 44330.0f, 5.255f);
  if (factor <= 0) {
      // Retourner une valeur invalide comme 0
      return 0;
  }
  int32_t sealevel_p = (int32_t)((float)pressure_Pa / factor);
  return sealevel_p; // Calcule la pression au niveau de la mer
} // Correction: Ajout de l'accolade fermante manquante

/* ============================================================================
 * API ASYNCHRONE (IT uniquement)
 * @note DMA non implémenté : bus I2C partagé multi-capteurs (arbitrage impossible)
 *       et trames courtes (BMP280 = 6 octets, BMP085/180 = 2+3 octets).
 * ============================================================================ */

/**
 * @brief  Initialise le contexte asynchrone
 * @param  ctx  Contexte async à initialiser (non NULL)
 * @param  bmp  Handle capteur associé (non NULL)
 * @retval None
 */
void BMP_Async_Init(BMP_Async_t *ctx, BMP_Handle_t *bmp) {
    if (ctx == NULL || bmp == NULL) return;
    
    ctx->bmp = bmp;
    ctx->state = BMP_ASYNC_IDLE;
    ctx->last_status = BMP_OK;
    ctx->async_busy = 0U;
    ctx->last_hal_error = 0U;
    ctx->sample_interval_ms = BMPX_DEFAULT_SAMPLE_INTERVAL_MS;
    ctx->conv_deadline_ms = 0;
    ctx->i2c_deadline_ms = 0;
    
    ctx->data_ready_flag = false;
    ctx->error_flag = false;
    ctx->notify_data_pending = false;
    ctx->notify_error_pending = false;
    
    ctx->on_data_ready = NULL;
    ctx->on_error = NULL;
    ctx->on_irq_data_ready = NULL;
    ctx->on_irq_error = NULL;
    ctx->user_ctx = NULL;
    ctx->irq_user_ctx = NULL;
}

/**
 * @brief  Réinitialise la machine d'état async sans perdre les callbacks
 * @param  ctx  Contexte asynchrone à réinitialiser (non NULL)
 * @retval None
 */
void BMP_Async_Reset(BMP_Async_t *ctx) {
    if (ctx == NULL) return;

    ctx->state                = BMP_ASYNC_IDLE;
    ctx->last_status          = BMP_OK;
    ctx->async_busy           = 0U;
    ctx->last_hal_error       = 0U;
    ctx->conv_deadline_ms     = 0;
    ctx->i2c_deadline_ms      = 0;                // Réinitialise deadline I2C
    ctx->data_ready_flag      = false;            // Efface flag données prêtes
    ctx->error_flag           = false;            // Efface flag erreur
    ctx->notify_data_pending  = false;            // Annule notification data en attente
    ctx->notify_error_pending = false;            // Annule notification erreur en attente

