TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
    /* bmp, mode, callbacks et user_ctx sont préservés */
}

/**
 * @brief Configure les callbacks utilisateur
 */
void BMP_Async_SetCallbacks(BMP_Async_t *ctx,
                            BMP_Async_OnDataReadyCb on_data_ready,
                            BMP_Async_OnErrorCb on_error,
                            void *user_ctx) {
    if (ctx == NULL) return;
    ctx->on_data_ready = on_data_ready;
    ctx->on_error = on_error;
    ctx->user_ctx = user_ctx;
}

/**
 * @brief Configure les callbacks IRQ-safe
 */
void BMP_Async_SetIrqCallbacks(BMP_Async_t *ctx,
                               BMP_Async_OnIrqDataReadyCb on_irq_data_ready,
                               BMP_Async_OnIrqErrorCb on_irq_error,
                               void *irq_user_ctx) {
    if (ctx == NULL) return;
    ctx->on_irq_data_ready = on_irq_data_ready;
    ctx->on_irq_error = on_irq_error;
    ctx->irq_user_ctx = irq_user_ctx;
}

/**
 * @brief Calcule délai conversion pression selon mode
 */
static uint32_t BMP_GetPressureConvDelay(uint8_t mode) {
    switch (mode) {
        case BMP_ULTRALOWPOWER: return BMP_PRES_CONVERSION_DELAY_ULP;
        case BMP_STANDARD: return BMP_PRES_CONVERSION_DELAY_STD;
        case BMP_HIGHRES: return BMP_PRES_CONVERSION_DELAY_HR;
        case BMP_ULTRAHIGHRES: return BMP_PRES_CONVERSION_DELAY_UHR;
        default: return BMP_PRES_CONVERSION_DELAY_STD;
    }
}

/**
 * @brief Déclenche lecture async mode IT
 */
BMP_Status BMP_ReadAll_IT(BMP_Async_t *ctx) {
    if (ctx == NULL || ctx->bmp == NULL) {
        return BMP_ERR_NULL_PTR;
    }
    
    if (ctx->state != BMP_ASYNC_IDLE) {
        return BMP_ERR_BUSY;
    }
    
    ctx->last_status = BMP_OK;
    ctx->i2c_deadline_ms = HAL_GetTick() + BMP_I2C_TIMEOUT;

    if (ctx->bmp->sensorType == BMP_SENSOR_BMP280) {
        ctx->state = BMP_ASYNC_READ_TEMP_RX;
        HAL_StatusTypeDef hal_status = HAL_I2C_Mem_Read_IT(
            ctx->bmp->hi2c, (uint16_t)(ctx->bmp->i2cAddr7bit << 1),
            BMP280_REG_PRESS_MSB, 1, ctx->bmp280_rx_buf, 6);

        if (hal_status != HAL_OK) {
            if (hal_status == HAL_BUSY) {
                ctx->state = BMP_ASYNC_IDLE;
                ctx->last_status = BMP_ERR_BUSY;
                return BMP_ERR_BUSY;
            }
            if (hal_status == HAL_TIMEOUT) {
                ctx->last_status = BMP_ERR_TIMEOUT;
                return BMP_ERR_TIMEOUT;
            }
            ctx->last_status = BMP_ERR_I2C;
            return BMP_ERR_I2C;
        }
        ctx->async_busy = 1U;
        return BMP_OK;
    }

    ctx->state = BMP_ASYNC_READ_TEMP_TX;
    
    /* Envoi commande lecture température (IT) */
    uint8_t cmd = BMP_READTEMPCMD;
    HAL_StatusTypeDef hal_status = HAL_I2C_Mem_Write_IT(
        ctx->bmp->hi2c, (uint16_t)(ctx->bmp->i2cAddr7bit << 1), 
        BMP_CONTROL, 1, &cmd, 1);
    
    if (hal_status != HAL_OK) {
        if (hal_status == HAL_BUSY) {
            ctx->state = BMP_ASYNC_IDLE;
            ctx->last_status = BMP_ERR_BUSY;
            return BMP_ERR_BUSY;
        }
        ctx->state = BMP_ASYNC_ERROR;
        if (hal_status == HAL_TIMEOUT) {
            ctx->last_status = BMP_ERR_TIMEOUT;
            return BMP_ERR_TIMEOUT;
        }
        ctx->last_status = BMP_ERR_I2C;
        return BMP_ERR_I2C;
    }

    ctx->async_busy = 1U;
    return BMP_OK;
}

/**
 * @brief Machine à états asynchrone
 */
void BMP_Async_Process(BMP_Async_t *ctx, uint32_t now_ms) {
    if (ctx == NULL) return;
    
    // Notifications callbacks
    if (ctx->notify_data_pending) {
        ctx->notify_data_pending = false;
        if (ctx->on_data_ready) {
            ctx->on_data_ready(ctx->user_ctx, &ctx->data, ctx->last_status);
        }
        return;
    }
    
    if (ctx->notify_error_pending) {
        ctx->notify_error_pending = false;
        if (ctx->on_error) {
            ctx->on_error(ctx->user_ctx, ctx->last_status);
        }
        return;
    }
    
    // Machine à états
    switch (ctx->state) {
        case BMP_ASYNC_IDLE:
        case BMP_ASYNC_DONE:
        case BMP_ASYNC_ERROR:
            break;
            
        case BMP_ASYNC_READ_TEMP_TX:
            // Attente callback TxCplt
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {
                ctx->state = BMP_ASYNC_ERROR;
                ctx->last_status = BMP_ERR_TIMEOUT;
                ctx->error_flag = true;
            }
            break;
            
        case BMP_ASYNC_WAIT_TEMP:
            // Attente conversion température
            if ((int32_t)(now_ms - ctx->conv_deadline_ms) >= 0) {
                // Lance lecture données température
                ctx->state = BMP_ASYNC_READ_TEMP_RX;
                ctx->i2c_deadline_ms = now_ms + BMP_I2C_TIMEOUT;
                
                HAL_StatusTypeDef hal_status = HAL_I2C_Mem_Read_IT(
                    ctx->bmp->hi2c, (uint16_t)(ctx->bmp->i2cAddr7bit << 1),
                    BMP_TEMPDATA, 1, ctx->temp_rx_buf, 2);
                
                if (hal_status != HAL_OK) {
                    ctx->state = BMP_ASYNC_ERROR;
                    if (hal_status == HAL_BUSY) {
                        ctx->last_status = BMP_ERR_BUSY;
                    } else if (hal_status == HAL_TIMEOUT) {
                        ctx->last_status = BMP_ERR_TIMEOUT;
                    } else {
                        ctx->last_status = BMP_ERR_I2C;
                    }
                    ctx->error_flag = true;
                }
            }
            break;
            
        case BMP_ASYNC_READ_TEMP_RX:
            // Attente callback RxCplt température
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {
                ctx->state = BMP_ASYNC_ERROR;
                ctx->last_status = BMP_ERR_TIMEOUT;
                ctx->error_flag = true;
            }
            break;
            
        case BMP_ASYNC_READ_PRESS_TX:
            // Attente callback TxCplt pression
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {
                ctx->state = BMP_ASYNC_ERROR;
                ctx->last_status = BMP_ERR_TIMEOUT;
                ctx->error_flag = true;
            }
            break;
            
        case BMP_ASYNC_WAIT_PRESS:
            // Attente conversion pression
            if ((int32_t)(now_ms - ctx->conv_deadline_ms) >= 0) {
                // Lance lecture données pression
                ctx->state = BMP_ASYNC_READ_PRESS_RX;
                ctx->i2c_deadline_ms = now_ms + BMP_I2C_TIMEOUT;
                
                HAL_StatusTypeDef hal_status = HAL_I2C_Mem_Read_IT(
                    ctx->bmp->hi2c, (uint16_t)(ctx->bmp->i2cAddr7bit << 1),
                    BMP_PRESSUREDATA, 1, ctx->press_rx_buf, 3);
                
