TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
                if (hal_status != HAL_OK) {
                    ctx->state = BMP_ASYNC_ERROR;
                    if (hal_status == HAL_BUSY) {
                        ctx->last_status = BMP_ERR_BUSY;
                    } else if (hal_status == HAL_TIMEOUT) {
                        ctx->last_status = BMP_ERR_TIMEOUT;
                    } else {
                        ctx->last_status = BMP_ERR_I2C;
                    }
                    ctx->error_flag = true;
                }
            }
            break;
            
        case BMP_ASYNC_READ_PRESS_RX:
            // Attente callback RxCplt pression
            if ((int32_t)(now_ms - ctx->i2c_deadline_ms) >= 0) {
                ctx->state = BMP_ASYNC_ERROR;
                ctx->last_status = BMP_ERR_TIMEOUT;
                ctx->error_flag = true;
            }
            break;
    }
}

bool BMP_Async_IsIdle(const BMP_Async_t *ctx) {
    return (ctx != NULL) && (ctx->state == BMP_ASYNC_IDLE);
}

bool BMP_Async_HasData(const BMP_Async_t *ctx) {
    return (ctx != NULL) && (ctx->state == BMP_ASYNC_DONE);
}

BMP_Status BMP_Async_GetData(BMP_Async_t *ctx, BMP_Data *out) {
    if (ctx == NULL || out == NULL) {
        return BMP_ERR_NULL_PTR;
    }
    
    if (ctx->state != BMP_ASYNC_DONE) {
        return BMP_ERR_BUSY;
    }
    
    *out = ctx->data;
    ctx->state = BMP_ASYNC_IDLE;
    ctx->data_ready_flag = false;
    ctx->notify_data_pending = false;
    return ctx->last_status;
}

bool BMP_Async_DataReadyFlag(const BMP_Async_t *ctx) {
    return (ctx != NULL) && ctx->data_ready_flag;
}

bool BMP_Async_ErrorFlag(const BMP_Async_t *ctx) {
    return (ctx != NULL) && ctx->error_flag;
}

void BMP_Async_ClearFlags(BMP_Async_t *ctx) {
    if (ctx == NULL) return;
    ctx->data_ready_flag = false;
    ctx->error_flag = false;
    ctx->notify_data_pending = false;
    ctx->notify_error_pending = false;
}

BMP_TickResult BMP_Async_Tick(BMP_Async_t *ctx, uint32_t now_ms, BMP_Data *data_out) {
    if (ctx == NULL) {
        return BMP_TICK_IDLE;
    }

    BMP_Async_Process(ctx, now_ms);

    if (BMP_Async_ErrorFlag(ctx) || ctx->state == BMP_ASYNC_ERROR) {
        BMP_Status err = ctx->last_status;
        BMP_Async_ClearFlags(ctx);
        ctx->async_busy = 0U;
        BMP_Async_Reset(ctx);
        ctx->last_status = err;
        return BMP_TICK_ERROR;
    }

    if (BMP_Async_DataReadyFlag(ctx) || BMP_Async_HasData(ctx)) {
        ctx->async_busy = 0U;
        if (data_out != NULL) {
            (void)BMP_Async_GetData(ctx, data_out);
        } else {
            BMP_Data drop;
            (void)BMP_Async_GetData(ctx, &drop);
        }
        return BMP_TICK_DATA_READY;
    }

    if (BMP_Async_IsIdle(ctx)) {
        return BMP_TICK_IDLE;
    }

    return BMP_TICK_BUSY;
}

BMP_Status BMP_Async_TriggerEvery(BMP_Async_t *ctx, uint32_t now_ms,
                                    uint32_t *last_ms) {
    if (ctx == NULL || last_ms == NULL) {
        return BMP_ERR_INVALID_PARAM;
    }

    if (!BMP_Async_IsIdle(ctx)) {
        return BMP_OK;  /* occupé — pas une erreur, retente au prochain appel */
    }

    if ((uint32_t)(now_ms - *last_ms) < ctx->sample_interval_ms) {
        return BMP_OK;
    }

    BMP_Status st = BMP_ReadAll_IT(ctx);
    if (st == BMP_OK) {
        *last_ms = now_ms;
    }
    return st;
}

/* ============================================================================
 * Callbacks HAL
 * ============================================================================ */

void BMP_Async_OnI2CMasterTxCplt(BMP_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (ctx == NULL || ctx->bmp == NULL || ctx->bmp->hi2c != hi2c) return;
    
    if (ctx->state == BMP_ASYNC_READ_TEMP_TX) {
        // Commande température envoyée -> attente conversion
        ctx->state = BMP_ASYNC_WAIT_TEMP;
        ctx->conv_deadline_ms = HAL_GetTick() + BMP_TEMP_CONVERSION_DELAY;
    }
    else if (ctx->state == BMP_ASYNC_READ_PRESS_TX) {
        // Commande pression envoyée -> attente conversion
        ctx->state = BMP_ASYNC_WAIT_PRESS;
        uint32_t delay = BMP_GetPressureConvDelay(ctx->bmp->oversampling);
        ctx->conv_deadline_ms = HAL_GetTick() + delay;
    }
}

void BMP_Async_OnI2CMasterRxCplt(BMP_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (ctx == NULL || ctx->bmp == NULL || ctx->bmp->hi2c != hi2c) return;
    
    if (ctx->state == BMP_ASYNC_READ_TEMP_RX) {
        if (ctx->bmp->sensorType == BMP_SENSOR_BMP280) {
            int32_t adc_P = ((int32_t)ctx->bmp280_rx_buf[0] << 12)
                          | ((int32_t)ctx->bmp280_rx_buf[1] << 4)
                          | ((int32_t)ctx->bmp280_rx_buf[2] >> 4);
            int32_t adc_T = ((int32_t)ctx->bmp280_rx_buf[3] << 12)
                          | ((int32_t)ctx->bmp280_rx_buf[4] << 4)
                          | ((int32_t)ctx->bmp280_rx_buf[5] >> 4);

            int32_t t01 = bmp280_comp_temp_01C(ctx->bmp, adc_T);
            int32_t pPa = bmp280_comp_press_Pa(ctx->bmp, adc_P);

            if (ctx->bmp->last_error != BMP_OK) {
                ctx->state = BMP_ASYNC_ERROR;
                ctx->last_status = ctx->bmp->last_error;
                ctx->error_flag = true;
                if (ctx->on_irq_error) ctx->on_irq_error(ctx->irq_user_ctx);
                ctx->notify_error_pending = true;
                return;
            }

            ctx->data.temperature = (float)t01 / 100.0f;
            ctx->data.pressure = pPa;
            ctx->state = BMP_ASYNC_DONE;
            ctx->last_status = BMP_OK;
            ctx->data_ready_flag = true;

            if (ctx->on_irq_data_ready) ctx->on_irq_data_ready(ctx->irq_user_ctx);
            ctx->notify_data_pending = true;
            return;
        }

        // Température reçue -> lance lecture pression
        ctx->state = BMP_ASYNC_READ_PRESS_TX;
        ctx->i2c_deadline_ms = HAL_GetTick() + BMP_I2C_TIMEOUT;
        
        uint8_t cmd = BMP_READPRESSURECMD + (ctx->bmp->oversampling << 6);
        HAL_StatusTypeDef hal_status;
        
