TutoElectroWeb/STM32_BMPX/STM32_BMPX.c
        hal_status = HAL_I2C_Mem_Write_IT(
            ctx->bmp->hi2c, (uint16_t)(ctx->bmp->i2cAddr7bit << 1),
            BMP_CONTROL, 1, &cmd, 1);
        
        if (hal_status != HAL_OK) {
            ctx->state = BMP_ASYNC_ERROR;
            if (hal_status == HAL_BUSY) {
                ctx->last_status = BMP_ERR_BUSY;
            } else if (hal_status == HAL_TIMEOUT) {
                ctx->last_status = BMP_ERR_TIMEOUT;
            } else {
                ctx->last_status = BMP_ERR_I2C;
            }
            ctx->error_flag = true;
            if (ctx->on_irq_error) ctx->on_irq_error(ctx->irq_user_ctx);
            ctx->notify_error_pending = true;
        }
    }
    else if (ctx->state == BMP_ASYNC_READ_PRESS_RX) {
        // Pression reçue -> calculs finaux
        
        // Calcul température (logique BMP085/180)
        int32_t ut = ((int32_t)ctx->temp_rx_buf[0] << 8) | ctx->temp_rx_buf[1];
        int32_t x1 = ((ut - ctx->bmp->ac6) * ctx->bmp->ac5) >> 15;
        int32_t denom = x1 + ctx->bmp->md;
        if (denom == 0) {
            ctx->state = BMP_ASYNC_ERROR;
            ctx->last_status = BMP_ERR_MATH;
            ctx->error_flag = true;
            if (ctx->on_irq_error) ctx->on_irq_error(ctx->irq_user_ctx);
            ctx->notify_error_pending = true;
            return;
        }
        int32_t x2 = ((int32_t)ctx->bmp->mc << 11) / denom;
        int32_t b5 = x1 + x2;
        ctx->data.temperature = ((b5 + 8) >> 4) / 10.0f;
        
        // Calcul pression (logique BMP085/180)
        int32_t up = (((int32_t)ctx->press_rx_buf[0] << 16) | 
                      ((int32_t)ctx->press_rx_buf[1] << 8) | 
                      ctx->press_rx_buf[2]) >> (8 - ctx->bmp->oversampling);
        
        int32_t b6 = b5 - 4000;
        x1 = (ctx->bmp->b2 * ((b6 * b6) >> 12)) >> 11;
        x2 = (ctx->bmp->ac2 * b6) >> 11;
        int32_t x3 = x1 + x2;
        int32_t b3 = ((((int32_t)ctx->bmp->ac1 * 4 + x3) << ctx->bmp->oversampling) + 2) >> 2;
        
        x1 = (ctx->bmp->ac3 * b6) >> 13;
        x2 = (ctx->bmp->b1 * ((b6 * b6) >> 12)) >> 16;
        x3 = ((x1 + x2) + 2) >> 2;
        uint32_t b4 = (ctx->bmp->ac4 * (uint32_t)(x3 + 32768)) >> 15;
        if (b4 == 0u) {
            ctx->state = BMP_ASYNC_ERROR;
            ctx->last_status = BMP_ERR_MATH;
            ctx->error_flag = true;
            if (ctx->on_irq_error) ctx->on_irq_error(ctx->irq_user_ctx);
            ctx->notify_error_pending = true;
            return;
        }
        uint32_t b7 = ((uint32_t)up - b3) * (50000 >> ctx->bmp->oversampling);
        
        int32_t p;
        if (b7 < 0x80000000) {
            p = (b7 << 1) / b4;
        } else {
            p = (b7 / b4) << 1;
        }
        
        x1 = (p >> 8) * (p >> 8);
        x1 = (x1 * 3038) >> 16;
        x2 = (-7357 * p) >> 16;
        ctx->data.pressure = p + ((x1 + x2 + 3791) >> 4);
        
        ctx->state = BMP_ASYNC_DONE;
        ctx->last_status = BMP_OK;
        ctx->data_ready_flag = true;
        
        if (ctx->on_irq_data_ready) ctx->on_irq_data_ready(ctx->irq_user_ctx);
        ctx->notify_data_pending = true;
    }
}

void BMP_Async_OnI2CError(BMP_Async_t *ctx, I2C_HandleTypeDef *hi2c) {
    if (ctx == NULL || ctx->bmp == NULL || ctx->bmp->hi2c != hi2c) return;

    if (ctx->state != BMP_ASYNC_IDLE && ctx->state != BMP_ASYNC_DONE) {
        ctx->state          = BMP_ASYNC_ERROR;
        ctx->last_status    = BMP_ERR_I2C;
        ctx->async_busy     = 0U;
        ctx->last_hal_error = (uint32_t)HAL_I2C_GetError(hi2c);
        ctx->error_flag     = true;
        /* Propagation vers le handle principal */
        if (ctx->bmp->consecutive_errors < 0xFFU)
            ctx->bmp->consecutive_errors++;
        ctx->bmp->last_hal_error = ctx->last_hal_error;
        ctx->bmp->last_error     = BMP_ERR_I2C;

        if (ctx->on_irq_error) ctx->on_irq_error(ctx->irq_user_ctx);
        ctx->notify_error_pending = true;
    }
}
